loadTestLogs/8.3_01.txt
Started phase 0 (Warm Up (1 req per sec)), duration: 10s @ 20:14:18(-0700) 2021-08-03
Report @ 20:14:28(-0700) 2021-08-03
Elapsed time: 10 seconds
  Scenarios launched:  9
  Scenarios completed: 9
  Requests completed:  9
  Mean response/sec: 1
  Response time (msec):
    min: 23
    max: 134
    median: 91
    p95: 134
    p99: 134
  Codes:
    200: 9

Started phase 1 (ramp up 1 (10 req per sec)), duration: 10s @ 20:14:28(-0700) 2021-08-03
Report @ 20:14:38(-0700) 2021-08-03
Elapsed time: 20 seconds
  Scenarios launched:  51
  Scenarios completed: 51
  Requests completed:  51
  Mean response/sec: 5.11
  Response time (msec):
    min: 16
    max: 53
    median: 22
    p95: 27
    p99: 52.8
  Codes:
    200: 51

Started phase 2 (ramp up 2 (100 req per sec)), duration: 120s @ 20:14:39(-0700) 2021-08-03
Report @ 20:14:48(-0700) 2021-08-03
Elapsed time: 30 seconds
  Scenarios launched:  142
  Scenarios completed: 140
  Requests completed:  140
  Mean response/sec: 14.21
  Response time (msec):
    min: 13
    max: 28
    median: 20
    p95: 24
    p99: 25.3
  Codes:
    200: 140

Report @ 20:14:58(-0700) 2021-08-03
Elapsed time: 40 seconds
  Scenarios launched:  207
  Scenarios completed: 208
  Requests completed:  208
  Mean response/sec: 20.89
  Response time (msec):
    min: 12
    max: 46
    median: 17
    p95: 22
    p99: 44.4
  Codes:
    200: 208

Report @ 20:15:08(-0700) 2021-08-03
Elapsed time: 50 seconds
  Scenarios launched:  281
  Scenarios completed: 280
  Requests completed:  280
  Mean response/sec: 28.13
  Response time (msec):
    min: 12
    max: 75
    median: 15.5
    p95: 20.5
    p99: 46.1
  Codes:
    200: 280

Report @ 20:15:18(-0700) 2021-08-03
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  347
  Scenarios completed: 349
  Requests completed:  349
  Mean response/sec: 34.73
  Response time (msec):
    min: 11
    max: 54
    median: 15
    p95: 21
    p99: 30
  Codes:
    200: 349

Report @ 20:15:28(-0700) 2021-08-03
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  427
  Scenarios completed: 425
  Requests completed:  425
  Mean response/sec: 42.79
  Response time (msec):
    min: 10
    max: 45
    median: 14
    p95: 20
    p99: 22
  Codes:
    200: 425

Report @ 20:15:38(-0700) 2021-08-03
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  515
  Scenarios completed: 516
  Requests completed:  516
  Mean response/sec: 51.55
  Response time (msec):
    min: 10
    max: 26
    median: 13
    p95: 19
    p99: 20
  Codes:
    200: 516

Report @ 20:15:48(-0700) 2021-08-03
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  574
  Scenarios completed: 575
  Requests completed:  575
  Mean response/sec: 57.4
  Response time (msec):
    min: 9
    max: 24
    median: 13
    p95: 18
    p99: 20
  Codes:
    200: 575

Report @ 20:15:58(-0700) 2021-08-03
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  673
  Scenarios completed: 672
  Requests completed:  672
  Mean response/sec: 67.3
  Response time (msec):
    min: 9
    max: 96
    median: 12
    p95: 18
    p99: 37.2
  Codes:
    200: 670
    500: 2

Report @ 20:16:08(-0700) 2021-08-03
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  734
  Scenarios completed: 734
  Requests completed:  734
  Mean response/sec: 73.4
  Response time (msec):
    min: 9
    max: 31
    median: 12
    p95: 17
    p99: 20
  Codes:
    200: 734

Report @ 20:16:18(-0700) 2021-08-03
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  792
  Scenarios completed: 792
  Requests completed:  792
  Mean response/sec: 79.28
  Response time (msec):
    min: 9
    max: 67
    median: 11
    p95: 17
    p99: 21.6
  Codes:
    200: 792

Report @ 20:16:28(-0700) 2021-08-03
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  889
  Scenarios completed: 888
  Requests completed:  888
  Mean response/sec: 88.99
  Response time (msec):
    min: 9
    max: 50
    median: 11
    p95: 15
    p99: 21.6
  Codes:
    200: 888

Report @ 20:16:38(-0700) 2021-08-03
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  959
  Scenarios completed: 960
  Requests completed:  960
  Mean response/sec: 96
  Response time (msec):
    min: 9
    max: 24
    median: 10
    p95: 13
    p99: 17
  Codes:
    200: 960

Started phase 3 (ramp up 3 (1000 req per sec)), duration: 300s @ 20:16:39(-0700) 2021-08-03
Report @ 20:16:48(-0700) 2021-08-03
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  899
  Scenarios completed: 900
  Requests completed:  900
  Mean response/sec: 89.9
  Response time (msec):
    min: 6
    max: 24
    median: 12
    p95: 18
    p99: 20.5
  Codes:
    200: 894
    500: 6

Report @ 20:16:58(-0700) 2021-08-03
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  1039
  Scenarios completed: 1038
  Requests completed:  1038
  Mean response/sec: 104.11
  Response time (msec):
    min: 5
    max: 60
    median: 12
    p95: 20
    p99: 35.1
  Codes:
    200: 1017
    500: 21

Report @ 20:17:08(-0700) 2021-08-03
Elapsed time: 2 minutes, 50 seconds
  Scenarios launched:  1205
  Scenarios completed: 1203
  Requests completed:  1203
  Mean response/sec: 120.62
  Response time (msec):
    min: 4
    max: 35
    median: 12
    p95: 18
    p99: 25
  Codes:
    200: 1178
    500: 25

Report @ 20:17:18(-0700) 2021-08-03
Elapsed time: 3 minutes, 0 seconds
  Scenarios launched:  1396
  Scenarios completed: 1395
  Requests completed:  1395
  Mean response/sec: 139.88
  Response time (msec):
    min: 5
    max: 81
    median: 12
    p95: 19
    p99: 43.5
  Codes:
    200: 1345
    500: 50

Report @ 20:17:28(-0700) 2021-08-03
Elapsed time: 3 minutes, 10 seconds
  Scenarios launched:  1611
  Scenarios completed: 1610
  Requests completed:  1610
  Mean response/sec: 161.26
  Response time (msec):
    min: 4
    max: 46
    median: 11
    p95: 18
    p99: 32
  Codes:
    200: 1546
    500: 64

Report @ 20:17:38(-0700) 2021-08-03
Elapsed time: 3 minutes, 20 seconds
  Scenarios launched:  1687
  Scenarios completed: 1689
  Requests completed:  1689
  Mean response/sec: 168.87
  Response time (msec):
    min: 4
    max: 113
    median: 12
    p95: 26
    p99: 57
  Codes:
    200: 1584
    500: 105

Report @ 20:17:48(-0700) 2021-08-03
Elapsed time: 3 minutes, 30 seconds
  Scenarios launched:  1848
  Scenarios completed: 1850
  Requests completed:  1850
  Mean response/sec: 184.98
  Response time (msec):
    min: 4
    max: 64
    median: 12
    p95: 22
    p99: 43
  Codes:
    200: 1707
    500: 143

Report @ 20:17:58(-0700) 2021-08-03
Elapsed time: 3 minutes, 40 seconds
  Scenarios launched:  1903
  Scenarios completed: 1897
  Requests completed:  1897
  Mean response/sec: 190.49
  Response time (msec):
    min: 4
    max: 258
    median: 14
    p95: 52
    p99: 109.6
  Codes:
    200: 1700
    500: 197

Report @ 20:18:08(-0700) 2021-08-03
Elapsed time: 3 minutes, 50 seconds
  Scenarios launched:  2057
  Scenarios completed: 2058
  Requests completed:  2058
  Mean response/sec: 206.11
  Response time (msec):
    min: 5
    max: 88
    median: 14
    p95: 29
    p99: 72
  Codes:
    200: 1844
    500: 214

Report @ 20:18:18(-0700) 2021-08-03
Elapsed time: 4 minutes, 0 seconds
  Scenarios launched:  2210
  Scenarios completed: 2213
  Requests completed:  2213
  Mean response/sec: 221.22
  Response time (msec):
    min: 5
    max: 107
    median: 13
    p95: 24
    p99: 83.4
  Codes:
    200: 1911
    500: 302

Report @ 20:18:28(-0700) 2021-08-03
Elapsed time: 4 minutes, 10 seconds
  Scenarios launched:  2192
  Scenarios completed: 2190
  Requests completed:  2190
  Mean response/sec: 219.42
  Response time (msec):
    min: 4
    max: 207
    median: 14
    p95: 66
    p99: 160.2
  Codes:
    200: 1871
    500: 319

Report @ 20:18:38(-0700) 2021-08-03
Elapsed time: 4 minutes, 20 seconds
  Scenarios launched:  2061
  Scenarios completed: 2062
  Requests completed:  2062
  Mean response/sec: 206.51
  Response time (msec):
    min: 5
    max: 224
    median: 18
    p95: 57
    p99: 172
  Codes:
    200: 1697
    500: 365

Report @ 20:18:48(-0700) 2021-08-03
Elapsed time: 4 minutes, 30 seconds
  Scenarios launched:  2309
  Scenarios completed: 2307
  Requests completed:  2307
  Mean response/sec: 231.13
  Response time (msec):
    min: 4
    max: 6264
    median: 14
    p95: 30
    p99: 120.7
  Codes:
    200: 1956
    500: 351

Report @ 20:18:58(-0700) 2021-08-03
Elapsed time: 4 minutes, 40 seconds
  Scenarios launched:  2349
  Scenarios completed: 2344
  Requests completed:  2344
  Mean response/sec: 235.14
  Response time (msec):
    min: 4
    max: 184
    median: 15
    p95: 35
    p99: 153
  Codes:
    200: 1955
    500: 389

Report @ 20:19:08(-0700) 2021-08-03
Elapsed time: 4 minutes, 50 seconds
  Scenarios launched:  2259
  Scenarios completed: 2257
  Requests completed:  2257
  Mean response/sec: 226.35
  Response time (msec):
    min: 5
    max: 212
    median: 17
    p95: 42.7
    p99: 174.9
  Codes:
    200: 1825
    500: 432

Report @ 20:19:18(-0700) 2021-08-03
Elapsed time: 5 minutes, 0 seconds
  Scenarios launched:  2316
  Scenarios completed: 2316
  Requests completed:  2316
  Mean response/sec: 230.45
  Response time (msec):
    min: 4
    max: 6199
    median: 17
    p95: 38
    p99: 72.7
  Codes:
    200: 1888
    500: 428

Report @ 20:19:28(-0700) 2021-08-03
Elapsed time: 5 minutes, 10 seconds
  Scenarios launched:  2308
  Scenarios completed: 2310
  Requests completed:  2310
  Mean response/sec: 231.03
  Response time (msec):
    min: 5
    max: 6179
    median: 17
    p95: 55
    p99: 200.8
  Codes:
    200: 1895
    500: 415

Report @ 20:19:38(-0700) 2021-08-03
Elapsed time: 5 minutes, 20 seconds
  Scenarios launched:  2249
  Scenarios completed: 2236
  Requests completed:  2236
  Mean response/sec: 224.58
  Response time (msec):
    min: 4
    max: 6194
    median: 18
    p95: 52
    p99: 220.8
  Codes:
    200: 1784
    500: 452

Report @ 20:19:48(-0700) 2021-08-03
Elapsed time: 5 minutes, 30 seconds
  Scenarios launched:  2388
  Scenarios completed: 2403
  Requests completed:  2403
  Mean response/sec: 239.14
  Response time (msec):
    min: 4
    max: 6375
    median: 17
    p95: 40.3
    p99: 293.3
  Codes:
    200: 1918
    500: 485

Report @ 20:19:58(-0700) 2021-08-03
Elapsed time: 5 minutes, 40 seconds
  Scenarios launched:  2535
  Scenarios completed: 2526
  Requests completed:  2526
  Mean response/sec: 254.01
  Response time (msec):
    min: 4
    max: 218
    median: 16
    p95: 36
    p99: 173.2
  Codes:
    200: 1989
    500: 537

Report @ 20:20:08(-0700) 2021-08-03
Elapsed time: 5 minutes, 50 seconds
  Scenarios launched:  2553
  Scenarios completed: 2558
  Requests completed:  2558
  Mean response/sec: 255.56
  Response time (msec):
    min: 5
    max: 6123
    median: 18
    p95: 42
    p99: 199
  Codes:
    200: 2072
    500: 486

Report @ 20:20:18(-0700) 2021-08-03
Elapsed time: 6 minutes, 0 seconds
  Scenarios launched:  2540
  Scenarios completed: 2546
  Requests completed:  2546
  Mean response/sec: 254.51
  Response time (msec):
    min: 5
    max: 6171
    median: 17
    p95: 39
    p99: 193
  Codes:
    200: 2015
    500: 531

Report @ 20:20:28(-0700) 2021-08-03
Elapsed time: 6 minutes, 10 seconds
  Scenarios launched:  2583
  Scenarios completed: 2575
  Requests completed:  2575
  Mean response/sec: 258.82
  Response time (msec):
    min: 4
    max: 6122
    median: 19
    p95: 45
    p99: 199.8
  Codes:
    200: 2036
    500: 539

Report @ 20:20:38(-0700) 2021-08-03
Elapsed time: 6 minutes, 20 seconds
  Scenarios launched:  2534
  Scenarios completed: 2532
  Requests completed:  2532
  Mean response/sec: 253.65
  Response time (msec):
    min: 5
    max: 6099
    median: 18
    p95: 46
    p99: 239.2
  Codes:
    200: 1965
    500: 567

Report @ 20:20:48(-0700) 2021-08-03
Elapsed time: 6 minutes, 30 seconds
  Scenarios launched:  2586
  Scenarios completed: 2590
  Requests completed:  2590
  Mean response/sec: 258.76
  Response time (msec):
    min: 4
    max: 6141
    median: 18
    p95: 43
    p99: 229
  Codes:
    200: 2052
    500: 538

Report @ 20:20:58(-0700) 2021-08-03
Elapsed time: 6 minutes, 40 seconds
  Scenarios launched:  2592
  Scenarios completed: 2594
  Requests completed:  2594
  Mean response/sec: 259.46
  Response time (msec):
    min: 5
    max: 6138
    median: 18
    p95: 48
    p99: 236.1
  Codes:
    200: 2058
    500: 536

Report @ 20:21:08(-0700) 2021-08-03
Elapsed time: 6 minutes, 50 seconds
  Scenarios launched:  2513
  Scenarios completed: 2504
  Requests completed:  2504
  Mean response/sec: 251.65
  Response time (msec):
    min: 4
    max: 6118
    median: 18
    p95: 50
    p99: 229
  Codes:
    200: 2023
    500: 481

Report @ 20:21:18(-0700) 2021-08-03
Elapsed time: 7 minutes, 0 seconds
  Scenarios launched:  2640
  Scenarios completed: 2645
  Requests completed:  2645
  Mean response/sec: 264
  Response time (msec):
    min: 4
    max: 6107
    median: 18
    p95: 52
    p99: 238
  Codes:
    200: 2122
    500: 523

Report @ 20:21:28(-0700) 2021-08-03
Elapsed time: 7 minutes, 10 seconds
  Scenarios launched:  2598
  Scenarios completed: 2596
  Requests completed:  2596
  Mean response/sec: 260.22
  Response time (msec):
    min: 4
    max: 6178
    median: 19
    p95: 52
    p99: 244.5
  Codes:
    200: 2047
    500: 549

Report @ 20:21:39(-0700) 2021-08-03
Elapsed time: 7 minutes, 20 seconds
  Scenarios launched:  2691
  Scenarios completed: 2694
  Requests completed:  2694
  Mean response/sec: 263.82
  Response time (msec):
    min: 4
    max: 6224
    median: 21
    p95: 50
    p99: 247.7
  Codes:
    200: 2137
    500: 557

Report @ 20:21:49(-0700) 2021-08-03
Elapsed time: 7 minutes, 30 seconds
  Scenarios launched:  2661
  Scenarios completed: 2659
  Requests completed:  2659
  Mean response/sec: 266.47
  Response time (msec):
    min: 4
    max: 6226
    median: 21
    p95: 54
    p99: 280.8
  Codes:
    200: 2098
    500: 561

Report @ 20:21:59(-0700) 2021-08-03
Elapsed time: 7 minutes, 40 seconds
  Scenarios launched:  2466
  Scenarios completed: 2461
  Requests completed:  2461
  Mean response/sec: 246.85
  Response time (msec):
    min: 4
    max: 6241
    median: 21
    p95: 113.4
    p99: 302.8
  Codes:
    200: 1986
    500: 475

Report @ 20:22:09(-0700) 2021-08-03
Elapsed time: 7 minutes, 50 seconds
  Scenarios launched:  2761
  Scenarios completed: 2776
  Requests completed:  2776
  Mean response/sec: 276.38
  Response time (msec):
    min: 4
    max: 6137
    median: 18
    p95: 43
    p99: 229
  Codes:
    200: 2278
    500: 498